backend/controllers/RpiController.php

SELECT COUNT(*) FROM `rpi`
---
    public function actionIndex()
    {
        $searchModel = new RpiSearch();
        $dataProvider = new ActiveDataProvider([
            'query' => Rpi::find(),
            'pagination' => [
                'pageSize' => 10,
            ],
        ]);

SELECT COUNT(*) FROM `rpi`
---
    public function actionRebooter()
    {
        $model = new Rpi();
        $action = Yii::$app->request->post('action');


        $searchModel = new RpiSearch();
        $dataProvider = new ActiveDataProvider([
            'query' => Rpi::find(),
            'pagination' => [
                'pageSize' => 12,
            ],
        ]);