common/models/User.php

    public static function findByVerificationToken($token) {
        return static::findOne([
            'verification_token' => $token,
            'status' => self::STATUS_INACTIVE
        ]);
---
SELECT * FROM `user` WHERE (`verification_token`='pLmaWtri6tCZvzkVmtvHToBxgtaJRXML_1655105530') AND (`status`=9)